["ingenier\u00eda", "de", "software,", "en", "su", "novena", "edici\u00f3n,", "se", "dirige", "principalmente", "a", "estudiantes", "universitarios", "que", "est\u00e1n", "inscritos", "cursos", "tanto", "introductorios", "como", "avanzados", "software", "y", "sistemas.", "asimismo,", "los", "ingenieros", "trabajan", "la", "industria", "encon-", "trar\u00e1n", "el", "libro", "\u00fatil", "lectura", "general", "para", "actualizar", "sus", "conocimientos", "acerca", "temas", "reutilizaci\u00f3n", "dise\u00f1o", "arquitect\u00f3nico,", "confiabilidad,", "seguridad", "mejora", "procesos.", "presente", "obra", "actualiz\u00f3", "al", "incorporar", "siguientes", "cambios:", ">", "nuevos", "cap\u00edtulos", "sobre", "\u00e1gil", "sistemas", "embebidos.", "nuevo", "material", "dirigida", "por", "modelos,", "desarrollo", "fuente", "abierta", "dirigido", "pruebas,", "modelo", "queso", "suizo", "reason,", "arquitecturas", "confiables,", "an\u00e1lisis", "est\u00e1tico", "com", "-", "probaci\u00f3n", "cots,", "servicio", "planeaci\u00f3n", "\u00e1gil.", "un", "estudio", "caso", "amplio", "alcance", "detalla", "sistema", "registro", "pacientes.", "enfoque", "del", "texto", "centra", "fundamentales", "todos", "procesos", "y,", "particular,", "fiables.", "s", "o", "m", "e", "r", "v", "i", "l", "9", "sommerville", "vis\u00edtenos", "en:", "www.pearsoneducacion.net", "addison-wesley", "es", "una", "marca", "mayor", "informaci\u00f3n,", "consulte", "www.pearsoneducation.net/sommerville", "isbn", "978-607-32-0603-7", "portada", "sommerville.indd", "1", "3/24/11", "6:08", "pm", "a01_sommerville_6037_9ed_se_i-xvi", "fm.indd", "xvia01_sommerville_6037_9ed_se_i-xvi", "xvi", "3/18/11", "4:42:02", "pm3/18/11", "edici\u00f3n", "ian", "traducci\u00f3n:", "v\u00edctor", "campos", "olgu\u00edn", "traductor", "especialista", "computacionales", "revisi\u00f3n", "t\u00e9cnica:", "sergio", "fuenlabrada", "vel\u00e1zquez", "edna", "martha", "miranda", "ch\u00e1vez", "miguel", "\u00e1ngel", "torres", "dur\u00e1n", "mario", "alberto", "sesma", "mart\u00ednez", "oviedo", "galdeano", "jos\u00e9", "luis", "l\u00f3pez", "goytia", "unidad", "profesional", "interdisciplinaria", "ciencias", "sociales", "administrativas-instituto", "polit\u00e9cnico", "nacional,", "m\u00e9xico", "dar\u00edo", "guillermo", "cardacci", "universidad", "interamericana,", "buenos", "aires,", "argentina", "marcelo", "mart\u00edn", "marciszack", "tecnol\u00f3gica", "c\u00f3rdoba,", "addison-w", "esley", "ia01_sommerville_6037_9ed_se_i-xvi", "3/22/11", "4:44:33", "pm3/22/11", "authorized", "translation", "from", "the", "english", "language", "edition,", "entitled", "engineering,", "9th", "by", "published", "pearson", "education,", "inc.,", "publishing", "as", "addison-wesley,", "copyright", "\u00a9", "2011.", "all", "rights", "reserved.", "9780137035151", "traducci\u00f3n", "autorizada", "idioma", "ingl\u00e9s,", "titulada", "9a", "publicada", "derechos", "reservados.", "esta", "espa\u00f1ol", "\u00fanica", "autorizada.", "editor:", "m.", "cruz", "castillo", "e-mail:", "luis.cruz@pearson.com", "editor", "desarrollo:", "felipe", "hern\u00e1ndez", "carrasco", "supervisor", "producci\u00f3n:", "juan", "garc\u00eda", "guzm\u00e1n", "2011", "d.r.", "educaci\u00f3n", "m\u00e9xico,", "s.a.", "c.v.", "atlacomulco", "500-5o.", "piso", "col.", "industrial", "atoto", "53519,", "naucalpan", "ju\u00e1rez,", "estado", "c\u00e1mara", "nacional", "editorial", "mexicana.", "reg.", "n\u00fam.", "1031.", "registrada", "reservados", "derechos.", "ni", "totalidad", "parte", "publicaci\u00f3n", "pueden", "reproducirse,", "registrarse", "transmitirse,", "po", "recuperaci\u00f3n", "ninguna", "forma", "ning\u00fan", "medio,", "sea", "electr\u00f3nico,", "mec\u00e1nico,", "fotoqu\u00edmico,", "magn\u00e9tico", "electro\u00f3ptico,", "fotocopia,", "grabaci\u00f3n", "cualquier", "otro,", "sin", "permiso", "previo", "escrito", "editor.", "pr\u00e9stamo,", "alquiler", "otra", "cesi\u00f3n", "uso", "este", "ejemplar", "requerir\u00e1", "tambi\u00e9n", "autorizaci\u00f3n", "representantes.", "versi\u00f3n", "impresa:", "e-book:", "978-607-32-0604-4", "e-chapter:", "978-607-32-0605-1", "primera", "impresi\u00f3n", "impreso", "m\u00e9xico.", "printed", "in", "mexico.", "2", "3", "4", "5", "6", "7", "8", "0", "14", "13", "12", "11", "datos", "catalogaci\u00f3n", "bibliogr\u00e1fica", "sommerville,", "p\u00e1ginas:", "792", "educaci\u00f3n,", "isbn:", "\u00e1rea:", "computaci\u00f3n", "formato:", "18.5", "23.5", "cm", "addison", "wesley", "iia01_sommerville_6037_9ed_se_i-xvi", "ii", "4:42:01", "prefacio", "mientras", "escrib\u00eda", "finales", "verano", "2009,", "me", "di", "cuenta", "ten\u00eda", "40", "a\u00f1os", "existencia.", "nombre", "\u201cingenier\u00eda", "software\u201d", "propuso", "1969", "conferencia", "organizaci\u00f3n", "tratado", "atl\u00e1ntico", "norte", "(otan)", "analizar", "problemas", "software;", "esa", "\u00e9poca", "hab\u00eda", "grandes", "estaban", "rezagados,", "no", "ofrec\u00edan", "fun-", "cionalidad", "requer\u00edan", "usuarios,", "costaban", "m\u00e1s", "lo", "esperado", "eran", "asist\u00ed", "dicha", "conferencia,", "pero", "a\u00f1o", "despu\u00e9s", "escrib\u00ed", "mi", "primer", "programa", "inici\u00e9", "vida", "software.", "progreso", "ha", "sido", "notable", "durante", "profesional.", "actualidad,", "nuestras", "sociedades", "podr\u00edan", "funcionar", "soft-", "ware", "profesionales.", "construir", "empresariales", "existe", "gran", "variedad", "tecnolog\u00edas", "(j2ee,", ".net,", "saas,", "sap,", "bpel4ws,", "soap,", "cbse,", "etc\u00e9tera)", "apoyan", "implementaci\u00f3n", "aplicaciones", "empresariales.", "servicios", "p\u00fablicos", "infraestructura", "nacionales", "(energ\u00eda,", "comunicaciones", "transporte)", "c\u00f3mputo", "complejos", "permitido", "exploraci\u00f3n", "espacio", "creaci\u00f3n", "world", "wide", "web,", "informaci\u00f3n", "signi-", "ficativo", "historia", "humanidad.", "mundo", "ahora", "enfrenta", "conjunto", "desaf\u00edos:", "cambio", "clim\u00e1tico", "temperaturas", "extremas,", "agotamiento", "recursos", "natu-", "rales,", "creciente", "poblaci\u00f3n", "mundial", "demanda", "alimentos", "vivienda,", "terrorismo", "internacional,", "necesidad", "ayudar", "adultos", "mayores", "tener", "vidas", "satisfactorias", "plenas.", "necesitamos", "nuevas", "enfrentar", "esos", "desde", "luego,", "desempe\u00f1ar\u00e1", "papel", "central", "dichas", "tecnolog\u00edas.", "tanto,", "tecnolog\u00eda", "muy", "importante", "futuro", "debemos", "continuar", "educando", "desarrollar", "disciplina", "manera", "puedan", "crearse", "complejos.", "a\u00fan", "existen", "con", "proyectos", "ocasiones,", "todav\u00eda", "funciona", "demoras", "costoso", "esperado.", "embargo,", "debe", "permitirse", "dichos", "oculten", "verdaderos", "\u00e9xitos", "tampoco", "m\u00e9todos", "impresionantes", "han", "desarrollado", "ese", "campo.", "especialidad", "tan", "vasta,", "ser\u00eda", "imposible", "cubrir", "toda", "materia", "libro.", "consecuencia,", "iiia01_sommerville_6037_9ed_se_i-xvi", "iii", "iv", "clave", "hay", "\u00e9nfasis", "\u00e1giles", "ware.", "creo", "firmemente", "tienen", "lugar,", "igual", "plan", "\u201ctradicional\u201d.", "necesario", "combinar", "mejor", "estos", "enfoques", "mejores", "libros", "inevitablemente", "reflejan", "las", "opiniones", "prejuicios", "autores.", "probable", "algunos", "lectores", "est\u00e9n", "desacuerdo", "mis", "elecci\u00f3n", "material.", "tal", "sano", "reflejo", "diversidad", "esen-", "cial", "evoluci\u00f3n.", "obstante,", "espero", "encontrar", "aqu\u00ed", "inter\u00e9s.", "integraci\u00f3n", "web", "incre\u00edble", "cantidad", "disponi-", "ble", "tanta,", "algunas", "personas", "cuestionado", "si", "\u00e9ste", "son", "necesarios.", "calidad", "disponible", "irregular;", "ocasiones", "presenta", "mal", "estructurada,", "resulta", "dif\u00edcil", "necesita.", "desempe\u00f1an", "funci\u00f3n", "aprendizaje.", "sirven", "mapa", "campo", "estudio;", "adem\u00e1s,", "permiten", "organizar", "t\u00e9cnicas,", "presentarla", "coherente", "legible.", "ofrecen", "punto", "partida", "efectuar", "profunda", "literatura", "investigaci\u00f3n", "web.", "futuro,", "s\u00f3lo", "integrados", "agregan", "valor", "ello,", "fue", "dise\u00f1ado", "h\u00edbrido", "combina", "publicado", "pues", "infor-", "maci\u00f3n", "vincula", "complementario", "medios", "electr\u00f3nicos.", "casi", "incluyen", "\u201csecciones", "web\u201d", "especialmente", "dise\u00f1a-", "das,", "dicho", "cap\u00edtulo.", "cuatro", "\u201ccap\u00edtu-", "cubrieron", "impresa", "sitio", "asocia", "es:", "http://softwareengineering-9.com", "tiene", "componentes", "principales:", "1.", "secciones", "trata", "adicionales", "con-", "tenido", "presentado", "cada", "vinculan", "partir", "recuadros", "conexi\u00f3n", "separados", "2.", "cubren", "formales,", "interacci\u00f3n,", "documentaci\u00f3n", "aplicaci\u00f3n.", "ser\u00e1", "posible", "agregar", "otros", "3.", "profesores", "secci\u00f3n", "intenci\u00f3n", "apoyar", "docentes", "ense\u00f1an", "v\u00e9ase", "\u201cmateriales", "apoyo\u201d", "prefacio.", "4.", "estudios", "adicional", "analizados", "(bomba", "insulina,", "atenci\u00f3n", "salud", "mental,", "iva01_sommerville_6037_9ed_se_i-xvi", "clima", "selv\u00e1tico),", "as\u00ed", "caso,", "falla", "cohete", "ariane", "5.", "paralelamente", "estas", "secciones,", "v\u00ednculos", "sitios", "software:", "lecturas", "complementarias,", "blogs,", "boletines,", "etc\u00e9tera.", "doy", "bienvenida", "comentarios", "sugerencias", "direcci\u00f3n", "electr\u00f3nica", "ian@softwareengineering-9.com.", "favor,", "anote", "[se9]", "asunto", "mensaje.", "otro", "modo,", "filtros", "spam", "probablemente", "rechazar\u00e1n", "mensaje", "usted", "recibir\u00e1", "respuesta.", "cabe", "aclarar", "resolver", "dudas", "relaci\u00f3n", "tareas", "escolares;", "medio", "comunicar", "texto.", "c\u00edrculo", "niveles", "superiores,", "encontrar\u00e1n", "seguridad,", "suposici\u00f3n", "completaron", "curso", "introducci\u00f3n", "programaci\u00f3n", "fami-", "liarizados", "terminolog\u00eda", "tema.", "cambios", "respecto", "ediciones", "anteriores", "conserva", "fundamental", "cubri\u00f3", "anteriores,", "fueron", "revisados", "actualizados,", "incluye", "muchos", "diferentes.", "impor-", "tantes", "son:", "dej\u00f3", "atr\u00e1s", "centrado", "exclusivamente", "impreso,", "dar", "paso", "inte-", "grado", "esto", "permiti\u00f3", "reducir", "n\u00famero", "enfocarse", "realiz\u00f3", "reestructuraci\u00f3n", "facilitar", "ense\u00f1anza", "consta", "partes", "vez", "ocho,", "puede", "usarse", "independiente", "combinaci\u00f3n", "otras", "base", "confiabilidad", "avanzada", "gesti\u00f3n", "presentan", "concisa", "solo", "cap\u00edtulo,", "trasladado", "adicionales,", "basados", "aqu\u00ed,", "disponibles", "va01_sommerville_6037_9ed_se_i-xvi", "vi", "revis\u00f3", "contenido", "cap\u00edtulos.", "entre", "30", "40%", "rescribi\u00f3", "completo.", "6.", "agregaron", "7.", "adem\u00e1s", "cap\u00edtulos,", "modelo,", "abierta,", "an\u00e1li-", "sis", "comprobaci\u00f3n", "8.", "incorpor\u00f3", "pacientes", "someten", "tratamiento", "mental.", "est\u00e1", "pueda", "utilizarse", "tres", "tipos", "diferentes", "generales", "dise\u00f1\u00f3", "expl\u00edcitamente", "semestre", "intermedios", "espec\u00edficos", "crear", "varios", "ejemplo,", "yo", "impart\u00ed", "cr\u00edti-", "cos", "usando", "2,", "junto", "administra-", "ci\u00f3n", "administraci\u00f3n", "configuraci\u00f3n.", "constituyen", "fundamento", "curso.", "complementa", "exploran", "tema", "detalle.", "podr\u00eda", "basarse", "16,", "17,", "18", "19.", "ense\u00f1anza,", "incluida", "comparaci\u00f3n", "anteriores.", "materiales", "apoyo", "usen", "impartir", "ellos", "incluyen:", "\u0081", "presentaciones", "powerpoint", "figuras", "powerpoint.", "via01_sommerville_6037_9ed_se_i-xvi", "vii", "gu\u00eda", "profesor", "da", "consejos", "c\u00f3mo", "usar", "cursos,", "explica", "ante-", "riores.", "arquitec-", "turas", "aplicaci\u00f3n", "documentaci\u00f3n.", "todo", "gratuita", "usuarios", "menciona", "adelante.", "adi-", "cional", "maestros", "restringida", "solamente", "acreditados:", "respuestas", "ejercicios", "seleccionados", "fin", "preguntas", "ex\u00e1menes", "apoyo,", "incluido", "protegido", "contrase\u00f1a,", "dispo-", "nible", "www.pearsoneducacion.net/sommerville", "obtener", "contrase\u00f1a", "ingresar", "restringido", "ponerse", "contacto", "representante", "local", "pearson.", "autor", "proporciona", "contrase\u00f1as.", "reconocimientos", "muchas", "contribuyeron", "trav\u00e9s", "evoluci\u00f3n", "quisiera", "agradecer", "revisores,", "comentaron", "edicio-", "nes", "hicieron", "constructivas", "realizar", "cambios.", "quiero", "familia", "(anne,", "ali", "jane)", "ayuda", "enorme", "agradecimiento", "especial", "hija", "jane,", "quien", "dio", "muestra", "talento", "corregir", "pruebas", "edici\u00f3n.", "participaci\u00f3n", "much\u00edsima", "ayuda,", "excelente", "trabajo", "leer", "libro,", "marcar", "corre-", "gir", "errores", "tipogr\u00e1ficos", "gramaticales.", "octubre", "2009", "viia01_sommerville_6037_9ed_se_i-xvi", "breve", "cap\u00edtulo", "27", "56", "requerimientos", "82", "modelado", "118", "arquitect\u00f3nico", "147", "176", "205", "234", "261", "10", "sociot\u00e9cnicos", "263", "289", "especificaci\u00f3n", "309", "341", "366", "15", "garant\u00eda", "393", "423", "16", "425", "17", "basada", "452", "distribuido", "479", "19", "arquitectura", "orientada", "508", "20", "embebido", "537", "21", "aspectos", "565", "591", "22", "593", "23", "618", "24", "651", "25", "configuraci\u00f3n", "681", "26", "705", "glosario", "733", "\u00edndice", "anal\u00edtico", "749", "autores", "767", "viiia01_sommerville_6037_9ed_se_i-xvi", "viii", "1.1", "1.2", "\u00e9tica", "1.3", "2.1", "modelos", "proceso", "29", "2.2", "actividades", "36", "2.3", "43", "2.4", "unificado", "racional", "50", "3.1", "58", "3.2", "62", "ixa01_sommerville_6037_9ed_se_i-xvi", "ix", "x", "3.3", "extrema", "64", "3.4", "proyecto", "72", "3.5", "escalamiento", "74", "4.1", "funcionales", "84", "4.2", "documento", "91", "4.3", "94", "4.4", "99", "4.5", "adquisici\u00f3n", "100", "4.6", "validaci\u00f3n", "110", "4.7", "111", "5.1", "contexto", "121", "5.2", "interacci\u00f3n", "124", "5.3", "estructurales", "129", "5.4", "comportamiento", "133", "5.5", "138", "6.1", "decisiones", "151", "6.2", "vistas", "arquitect\u00f3nicas", "153", "6.3", "patrones", "arquitect\u00f3nicos", "155", "6.4", "164", "7.1", "orientado", "objetos", "uml", "178", "7.2", "189", "xa01_sommerville_6037_9ed_se_i-xvi", "7.3", "conflictos", "193", "7.4", "c\u00f3digo", "abierto", "198", "8.1", "210", "8.2", "221", "8.3", "224", "8.4", "usuario", "228", "9.1", "237", "9.2", "din\u00e1mica", "240", "9.3", "mantenimiento", "242", "9.4", "heredados", "252", "10.1", "266", "10.2", "273", "10.3", "procuraci\u00f3n", "275", "10.4", "278", "10.5", "operaci\u00f3n", "281", "11.1", "propiedades", "291", "11.2", "disponibilidad", "fiabilidad", "295", "11.3", "protecci\u00f3n", "299", "11.4", "302", "xi", "xia01_sommerville_6037_9ed_se_i-xvi", "xii", "12.1", "riesgos", "311", "12.2", "313", "12.3", "320", "12.4", "329", "12.5", "formal", "333", "13.1", "redundancia", "343", "13.2", "confiables", "345", "13.3", "348", "13.4", "confiable", "355", "14.1", "riesgo", "369", "14.2", "375", "14.3", "supervivencia", "386", "15.1", "395", "15.2", "401", "15.3", "404", "15.4", "aseguramiento", "406", "15.5", "casos", "410", "16.1", "panorama", "428", "16.2", "frameworks", "431", "xiia01_sommerville_6037_9ed_se_i-xvi", "16.3", "l\u00edneas", "productos", "434", "16.4", "cots", "440", "17.1", "455", "17.2", "cbse", "461", "17.3", "composici\u00f3n", "468", "18.1", "distribuidos", "481", "18.2", "cliente-servidor", "488", "18.3", "490", "18.4", "501", "19.1", "514", "19.2", "518", "19.3", "527", "20.1", "embebidos", "540", "20.2", "547", "20.3", "temporizaci\u00f3n", "554", "20.4", "operativos", "tiempo", "real", "558", "21.1", "separaci\u00f3n", "intereses", "567", "21.2", "aspectos,", "puntos", "enlaces", "corte", "571", "21.3", "576", "xiii", "xiiia01_sommerville_6037_9ed_se_i-xvi", "xiv", "22.1", "595", "22.2", "personal", "602", "22.3", "equipo", "607", "23.1", "fijaci\u00f3n", "precio", "621", "23.2", "623", "23.3", "calendarizaci\u00f3n", "626", "23.4", "631", "t\u00e9cnicas", "estimaci\u00f3n", "633", "24.1", "655", "24.2", "est\u00e1ndares", "657", "24.3", "revisiones", "inspecciones", "663", "24.4", "medici\u00f3n", "m\u00e9tricas", "668", "25.1", "685", "25.2", "versiones", "690", "25.3", "construcci\u00f3n", "693", "25.4", "entregas", "(release)", "699", "26.1", "708", "26.2", "711", "xiva01_sommerville_6037_9ed_se_i-xvi", "26.3", "715", "26.4", "718", "26.5", "marco", "cmmi", "721", "xv", "xva01_sommerville_6037_9ed_se_i-xvi", "meta", "ofrecer", "conceptos", "importantes", "\u00e1giles;", "describen", "esencia-", "les", "inicial", "hasta", "sistema.", "dise\u00f1aron", "introduce", "lector", "define", "respecto.", "escribe", "\u00e9ticos", "consideren", "nume-", "rosas", "implicaciones", "trabajo.", "usan", "saber:", "adminis-", "trar", "registros", "control", "bomba", "insulina", "port\u00e1til", "meteorol\u00f3gico", "abierto.", "tratan", "gen\u00e9rico", "com\u00fan,", "waterfall", "(cascada),", "estudian", "b\u00e1sicas", "usa", "m01_sommerville_ingenieria_1ed_se_001-026.indd", "1m01_sommerville_ingenieria_1ed_se_001-026.indd", "4:44:28", "ejemplo", "m\u00e9todo", "\u00e1gil,", "aunque", "brevemente", "scrum.", "restantes", "amplias", "descripciones", "introducir\u00e1n", "requerimientos,", "donde", "definen", "necesidades", "hacer", "uml,", "enfoca", "diagramas", "clase,", "secuencia", "modelar", "estudia", "importancia", "arqui-", "tectura", "dise\u00f1o.", "observan", "imple-", "mentaci\u00f3n:", "reutilizaci\u00f3n,", "manejo", "host-", "target", "(anfitri\u00f3n", "destino);", "prueba", "sistema,", "puesta", "venta", "analiza", "impulsado", "prueba,", "pionero", "\u00e1giles,", "aplicabilidad.", "finalmente,", "brinda", "evo-", "lutivos,", "legados.", "2m01_sommerville_ingenieria_1ed_se_001-026.indd", "objetivos", "consisten", "introducir", "conceptual", "entender", "resto", "estudiar", "cap\u00edtulo:", "\u25a0", "conocer\u00e1", "qu\u00e9", "importante;", "comprender\u00e1", "requerir", "distintas", "entender\u00e1", "profesionales", "tipos,", "usar\u00e1n", "ejemplos", "largo", "3m01_sommerville_ingenieria_1ed_se_001-026.indd", "operar", "moderno", "infraestructuras", "controlan", "mediante", "computadoras,", "mayor\u00eda", "el\u00e9ctricos", "computadora", "control.", "fabricaci\u00f3n", "distribuci\u00f3n", "completamente", "computarizadas,", "financiero.", "entretenimiento,", "musical,", "juegos", "computadora,", "cine", "televisi\u00f3n,", "intensiva.", "esencial", "funcionamiento", "sociedades,", "nivel", "internacional.", "abstractos", "intangibles.", "restringidos", "materiales,", "regidos", "leyes", "f\u00edsicas", "fabri-", "caci\u00f3n.", "simplifica", "l\u00edmites", "naturales", "potencial.", "debido", "falta", "restricciones", "f\u00edsicas,", "volverse", "r\u00e1pidamente", "complejos,", "dif\u00edciles", "costosos", "cambiar.", "simples", "embebidos,", "mundial.", "sentido", "bus-", "car", "notaciones,", "universales", "ya", "requieren", "distintos", "enfoques.", "orga-", "nizacional", "diferente", "controlador", "ins-", "trumento", "cient\u00edfico.", "ninguno", "mucho", "com\u00fan", "juego", "gr\u00e1ficos", "intensivos.", "todas", "necesitan", "ingenie-", "r\u00eda", "mismas", "reportes", "salen", "\u201cfallas", "software\u201d.", "le", "considera", "inadecuada", "moderno.", "perspectiva", "autor,", "llamadas", "fallas", "consecuencia", "dos", "factores:", "demandas", "crecientes", "conforme", "ayudan", "cambian.", "construirse", "distribuirse", "r\u00e1pidamente;", "incluso", "complejos;", "deben", "capacidades", "anteriormente", "consideraban", "imposibles.", "existentes", "situaci\u00f3n,", "desarrollarse", "t\u00e9cni-", "cas", "satisfacer", "demandas.", "expectativas", "bajas", "relativamente", "sencillo", "escribir", "programas", "compa\u00f1\u00edas", "deslizan", "hacia", "evolucionan", "servicios.", "diario.", "frecuencia", "menos", "debiera.", "nece-", "saria", "capacitaci\u00f3n", "solucionar", "problema.", "estar", "orgullosos", "logros.", "toda-", "v\u00eda", "complejo,", "pero,", "ware,", "habr\u00eda", "explorado", "tendr\u00eda", "internet", "telecomunicaciones", "modernas.", "formas", "viaje", "ser\u00edan", "peligrosas", "caras.", "contribuido", "medida,", "aportaciones", "siglo", "xxi", "ser\u00e1n", "mayores.", "4m01_sommerville_ingenieria_1ed_se_001-026.indd", "individuos", "escriben", "programas.", "empresas", "empleados", "hacen", "hoja", "c\u00e1lculo", "simplificar", "trabajo;", "cient\u00edficos", "elaboran", "progra-", "mas", "procesar", "experimentales,", "aficionados", "crean", "propio", "inter\u00e9s", "satisfacci\u00f3n.", "actividad", "profesional,", "realiza", "prop\u00f3sitos", "negocios", "espec\u00ed-", "ficos,", "inclusi\u00f3n", "dispositivos", "cad,", "destinado", "alguien", "aparte", "desarrollador,", "lleva", "cabo", "equipos,", "individualmente.", "mantiene", "cambia", "vida.", "busca", "lugar", "individual.", "especificaci\u00f3n,", "programa,", "cuales", "normalmente", "relevantes", "desa-", "rrollo", "personal.", "objetivo", "ayudarlo", "amplia", "visi\u00f3n", "figura", "resumen", "planteadas", "frecuencia.", "suponen", "palabra", "c\u00f3mpu-", "to.", "cuando", "habla", "refiere", "s\u00ed,", "sino", "asociada", "configu-", "raci\u00f3n", "requeridos", "operen", "correcta.", "profesionalmente", "usualmente", "programa.", "regular", "archivos", "figuraci\u00f3n", "instalar", "incluir", "describe", "estructura", "sistema;", "usuario,", "descarguen", "reciente", "producto.", "\u00e9sta", "principales", "diferencias", "aficionado.", "dise\u00f1a", "personal,", "nadie", "usar\u00e1", "tendr\u00e1", "preocuparse", "elaborar", "gu\u00edas", "documentar", "contrario,", "crea", "cambiar\u00e1n,", "entonces,", "adicional,", "concepto", "originalmente", "1968,", "realizada", "discutir", "entonces", "llamaba", "\u201ccrisis", "(naur", "randell,", "1969).", "volvi\u00f3", "claro", "individuales", "escalaban", "\u00e9stos", "distribu\u00edan", "demora.", "d\u00e9cadas", "1970", "1980", "desarroll\u00f3", "tales", "encubrimiento", "objetos.", "perfeccionaron", "herramientas", "notaciones", "est\u00e1ndar", "extensa.", "http://www.softwareengineering-9.com/web/history/", "5m01_sommerville_ingenieria_1ed_se_001-026.indd", "interesados", "(es", "decir,", "venderse", "cliente).", "gen\u00e9ricos", "independientes", "producen", "venden", "mercado", "cliente", "pregunta", "respuesta", "\u00bfqu\u00e9", "software?", "asociada.", "desarrollan", "particular", "general.", "\u00bfcu\u00e1les", "atributos", "buen", "entregar", "funcionalidad", "desempe\u00f1o", "requeridos,", "ser", "sustentable,", "utilizable.", "interesa", "producci\u00f3n", "desarrollo,", "\u00bfcu\u00e1l", "diferencia", "computaci\u00f3n?", "enfocan", "teor\u00eda", "fundamentos;", "pr\u00e1ctico", "sistemas?", "incluidos", "hardware,", "retos", "enfrentan", "creciente,", "tiempos", "limitados", "confiable.", "costos", "aproximadamente", "60%", "prueba.", "elaborado", "espec\u00edficamente,", "superan", "desarrollo.", "aun", "gestionarse", "adecuadas", "siempre", "dise\u00f1arse", "serie", "prototipos,", "cr\u00edticos", "completa", "analizable", "decirse", "otro.", "marcado", "llevado", "posibilidad", "ampliamente.", "conducido", "avances", "lenguajes", "6m01_sommerville_ingenieria_1ed_se_001-026.indd", "desee", "comprarlos.", "tipo", "pc,", "bases", "datos,", "procesadores", "texto,", "paquetes", "dibujo", "proyectos.", "abarcan", "verticales", "dise\u00f1adas", "cierto", "prop\u00f3sito", "espec\u00edfico,", "librer\u00eda,", "contabilidad", "mantener", "dentales.", "personalizados", "(o", "medida)", "destinados", "particular.", "contratista", "desarrolla", "especial-", "mente", "cliente.", "electr\u00f3nicos,", "escritos", "empresarial", "tr\u00e1fico", "a\u00e9reo.", "que,", "gen\u00e9-", "ricos,", "controla", "mismo.", "personalizados,", "compra", "generalmente", "desarrolladores", "trabajar", "siguiendo", "especificaci\u00f3n.", "distinci\u00f3n", "producto", "vuelve", "difusa.", "ahora,", "construyen", "base,", "luego", "adapta", "ajustarse", "sis-", "enterprise", "resource", "planning", "(erp,", "empresariales),", "enfoque.", "grande", "complejo", "compa\u00f1\u00eda", "reglas", "empresariales,", "considerar", "cambian", "personas,", "desarrolladores.", "ver", "hace", "cambio,", "ejecuta,", "refleja", "llamados", "ante", "duda", "comprensibilidad", "espec\u00edfico", "espera", "depende", "evidentemente", "as\u00ed,", "bancario", "seguro,", "ractivo", "capacidad", "respuesta,", "conmutaci\u00f3n", "telef\u00f3nica", "confiable,", "generalizarse", "1.2,", "consideran", "caracter\u00edsticas", "esenciales", "1.1.1", "primeras", "etapas", "pone", "operaci\u00f3n.", "definici\u00f3n", "frases", "clave:", "cosas", "funcionen.", "aplican", "teor\u00edas,", "adecuado.", "7m01_sommerville_ingenieria_1ed_se_001-026.indd", "selectiva", "soluciones", "problemas,", "teor\u00edas", "aplicables.", "reconocen", "tra-", "bajar", "organizacionales", "financieras,", "modo", "buscan", "solucio-", "dentro", "limitaciones.", "t\u00e9cnicos", "herramientas,", "resultados", "requerida", "fecha", "presupuesto.", "menudo", "requiere", "contraer", "compromisos:", "perfeccionistas.", "dise\u00f1an", "s\u00ed", "pasar", "deseen", "general,", "adoptan", "sistem\u00e1tico", "organizado,", "efectiva", "producir", "alta", "calidad.", "seleccionar", "adecuado", "circunstancias", "manera,", "acercamiento", "creativo", "efectivo", "ciertas", "situaciones.", "parti-", "cularmente", "mezcla", "habilidades", "gr\u00e1fico.", "razones:", "frecuencia,", "sociedad", "avan-", "zados", "ende,", "econ\u00f3mica", "confiables.", "descripci\u00f3n", "escribirse", "evolucionar", "cambiantes", "clientes.", "atributo", "cr\u00edtico", "porque", "requerimiento", "inevitable", "entorno", "variable.", "rango", "fiabilidad,", "protecci\u00f3n.", "causar", "da\u00f1o", "f\u00edsico", "econ\u00f3mico,", "malintencionados", "acceder", "da\u00f1arlo.", "eficiencia", "desperdiciar", "memoria", "ciclos", "procesador.", "procesamiento,", "utilizaci\u00f3n", "memoria,", "aceptabilidad", "aceptable", "quienes", "dise\u00f1a.", "significa", "necesita", "comprensible,", "utilizable", "compatible", "usan.", "8m01_sommerville_ingenieria_1ed_se_001-026.indd", "barato", "plazo", "dise\u00f1ar", "fuera", "sistemas,", "cambiar", "ponerlo", "conoce", "conducen", "elaboraci\u00f3n", "funda-", "mentales", "comunes", "\u00e9stas", "clientes", "producir\u00e1", "verifica", "asegurar", "requiere.", "modifica", "reflejar", "requerimien-", "tos", "mercado.", "aeronave", "especificarse", "completo", "antes", "comenzar", "comercio", "conjunto.", "gen\u00e9ricas", "organizarse", "describirse", "detalle,", "dependiendo", "vaya", "desarrollar.", "des-", "criben", "puntualidad", "relaciona", "inge-", "nier\u00eda", "sistemas:", "interesan", "sub-", "yacen", "computadoras", "preocupa", "asuntos", "pr\u00e1cticos", "conocimiento", "mismo", "f\u00edsica", "electricistas.", "aplicable", "peque\u00f1os.", "aplicarse", "soluci\u00f3n", "luci\u00f3n", "principal.", "dise-", "\u00f1o", "pol\u00edticas", "procesos,", "intervienen", "definiendo", "global", "integrando", "terminado.", "preocupados", "(hardware,", "etc\u00e9tera).", "9m01_sommerville_ingenieria_1ed_se_001-026.indd", "expone", "siguiente", "secci\u00f3n,", "t\u00e9cnica", "\u00e9stos.", "afectan", "diversos", "heterogeneidad", "redes", "incluyan", "m\u00f3viles.", "ejecute", "tel\u00e9fonos", "integrar", "legados", "viejos,", "programaci\u00f3n.", "reto", "confia-", "suficientemente", "flexible", "heterogeneidad.", "social", "incre\u00edblemente", "r\u00e1pida,", "econom\u00edas", "emergentes", "disposici\u00f3n.", "ambos", "existente", "uno", "nuevo.", "tradi-", "cionales", "consumen", "tiempo,", "entrega", "tarda", "planeado.", "reduzca", "d\u00e9", "confianza", "dado", "vinculado", "vida,", "confiar", "remoto", "accede", "p\u00e1gina", "interfaz", "asegurarse", "atacar", "conserve", "informaci\u00f3n.", "independientes.", "quiz\u00e1", "sario", "r\u00e1pidos", "legado", "finalidad", "dotarlo", "necesitar\u00e1n", "innovadoras", "1.1.2", "toma", "costo,", "sidades", "fabricantes", "realmente", "implementado", "var\u00eda", "dr\u00e1stica", "sean", "adecuados", "compa\u00f1\u00edas.", "bien,", "\u00faltimos", "evolu-", "cion\u00f3", "quiz\u00e1s", "factor", "significativo", "determinaci\u00f3n", "importantes,", "siendo", "desarrollada.", "aplicaci\u00f3n,", "siguientes:", "corren", "local,", "necesaria", "10m01_sommerville_ingenieria_1ed_se_001-026.indd", "4:44:29", "conectarse", "red.", "oficina", "manipulaci\u00f3n", "fotograf\u00edas,", "interactivas", "basadas", "transacci\u00f3n", "ejecutan", "remota", "acceden", "propias", "pc", "terminales.", "evidentemente,", "ellas", "interactuar", "comprar", "bienes", "clase", "acceso", "v\u00e9s", "navegador", "servi-", "cios", "nube,", "correo", "electr\u00f3nico", "compartici\u00f3n", "fotograf\u00edas.", "incorporan", "almac\u00e9n", "actualiza", "transacci\u00f3n.", "regulan", "gestionan", "hardware.", "num\u00e9ricamente,", "tel\u00e9fono", "m\u00f3vil", "(celular),", "frenos", "antibloqueo", "autom\u00f3vil", "horno", "microondas", "controlar", "cocinado.", "procesamiento", "lotes", "(batch).", "procesan", "entradas", "indivi-", "duales", "salidas", "correspondientes.", "batch", "facturaci\u00f3n", "peri\u00f3dica,", "pago", "salario.", "entretenimiento", "entretener", "usuario.", "u", "tipo.", "ofrecida", "caracter\u00edstica", "entretenimiento.", "simulaci\u00f3n", "cient\u00edfi-", "situaciones", "ob-", "jetos", "interactuantes.", "computacionalmente", "intensivos", "ejecuci\u00f3n", "paralelos", "alto", "desempe\u00f1o.", "recopilan", "sensores,", "env\u00edan", "sensores", "instala", "regularmente", "ambiente", "hostil,", "interior", "motor", "ubi-", "caci\u00f3n", "remota.", "compuestos", "gen\u00e9rico,", "c\u00e1lculo.", "ensamble", "escri-", "entorno.", "difusos.", "tomar", "restriccio-", "hardware)", "11m01_sommerville_ingenieria_1ed_se_001-026.indd", "tel\u00e9fono.", "conjunci\u00f3n", "compa\u00f1\u00eda,", "solicitudes", "gastos", "procesa", "mensual.", "por-", "quema", "rom", "veh\u00edculo;", "consiguiente,", "cambiarlo.", "verificaci\u00f3n", "exhaustivas,", "minimicen", "probabili-", "dades", "volver", "llamar", "autom\u00f3viles,", "venta,", "m\u00ednima", "inexistente),", "apoye", "prototipo", "basado", "iterativos,", "reutilizables.", "definirse", "adelantado", "especificaciones", "detalladas", "interacciones", "desarrolle", "separado.", "fundamentos", "llevarse", "administrado", "comprendido.", "planear", "ideas", "claras", "estar\u00e1", "comple-", "tado.", "comportarse", "espera,", "fallas,", "requiera", "disponible.", "seguro", "posible,", "contra", "ataques", "externos.", "desempe\u00f1arse", "eficiente", "recursos.", "comprender", "gestionar", "(lo", "hacer).", "conocerse", "esperan", "\u00e9l", "dife-", "rentes", "expectativas,", "existentes.", "adecuado,", "reutilizar", "haya", "rrollado,", "nociones", "proceso,", "diversas,", "subyacen", "destacar", "maci\u00f3n.", "espec\u00edficas", "programaci\u00f3n,", "var\u00edan", "dr\u00e1sticamente", "lenguaje", "guiones", "(scripts),", "ruby,", "sirve", "totalmente", "inadecuado", "12m01_sommerville_ingenieria_1ed_se_001-026.indd", "1.1.3", "tuvo", "profundo", "efecto", "vidas.", "inicio,", "b\u00e1sicamente", "universal", "accesible", "escaso", "corr\u00edan", "locales", "accesibles", "organizaci\u00f3n.", "alrededor", "2000,", "comenz\u00f3", "evolucionar,", "navegadores", "funcionalidades.", "signific\u00f3", "pod\u00edan", "tuviera", "espec\u00edfico.", "situaci\u00f3n", "condujo", "entregaban", "innovadores,", "cua-", "ingresaba", "financiaban", "anuncios", "publicitarios", "desplegaban", "pantalla", "directo", "usuarios.", "corrieran", "peque\u00f1os", "realizaran", "organizacional.", "implementarlo", "implementaba", "servidor", "avance", "hizo", "pc.", "redujo", "costos,", "interfaces", "bastante", "caro.", "dondequiera", "hacerlo,", "mudaron", "compa\u00f1\u00eda.", "etapa", "noci\u00f3n", "entregan", "espec\u00edfica", "\u00fatil,", "grar", "principio,", "vinculaci\u00f3n", "suele", "din\u00e1mica,", "utilice", "diferen-", "tes", "\u201csoftware", "servicio\u201d.", "pro-", "puso", "correr\u00eda", "locales,", "\u201cnubes", "c\u00f3mputo\u201d", "internet.", "utiliza", "nube.", "nube", "vinculados", "comparten", "compran", "pagan", "seg\u00fan", "utiliza,", "otorga", "gratuito", "despliegan", "pantallas.", "llegada", "organiza", "empresarial.", "empresa-", "riales", "monol\u00edticas,", "grupos", "computadoras.", "organiza-", "ci\u00f3n.", "ampliamente", "distribuido,", "mundo.", "programan", "cero,", "reutili-", "zaci\u00f3n", "extensiva", "efecto,", "radical", "conducir", "modificaciones", "nier\u00eda.", "ejemplo:", "convertido", "dominante", "piensa", "ensamblarlos", "preexistentes.", "13m01_sommerville_ingenieria_1ed_se_001-026.indd", "reconoce", "especificar", "desarro-", "llarse", "entregarse", "progresiva.", "restringidas", "ajax", "(holdener,", "2008)", "significan", "valiosas", "emplear.", "com\u00fanmente", "formatos", "escritura", "local.", "fre-", "cuencia", "deficientes", "espec\u00edficamente", "discutidas", "rior,", "misma", "xx,", "experiencia", "obtenida", "gran-", "des", "relevante", "disciplinas", "ingenier\u00eda,", "legal", "limita", "libertad", "gente", "trabaja", "\u00e1rea.", "ingeniero", "aceptar", "labor", "implica", "responsabilidades", "simple", "t\u00e9cnicas.", "moralmente", "responsable", "respetado", "fesional.", "sobra", "decir", "normales", "honestidad", "integridad.", "deshonesta", "desacredite", "profesi\u00f3n", "\u00e1reas", "acotados", "legis-", "laci\u00f3n,", "difusa", "responsabilidad", "confidencialidad", "respetar", "emplea-", "dores", "importar", "firm\u00f3", "acuerdo", "misma.", "competencia", "desvirtuar", "competencia.", "intencional", "est\u00e9", "propiedad", "intelectual", "conocer", "rigen", "intelectual,", "patentes", "copyright.", "cuidadoso", "garantizar", "protege", "empleadores", "emplear", "incorrectamente", "individuos.", "compu-", "tadoras", "trivial", "(esto", "es,", "distraerse", "compa\u00f1ero)", "extremadamente", "serio", "(diseminaci\u00f3n", "virus", "malware).", "14m01_sommerville_ingenieria_1ed_se_001-026.indd", "instituciones", "desempe-", "\u00f1ar", "establecimiento", "\u00e9ticos.", "organizaciones", "acm,", "instituto", "electr\u00f3nicos", "(ieee)", "british", "computer", "society", "publican", "conducta", "\u00e9tica.", "integrantes", "comprometen", "seguir", "firman", "afiliarse.", "c\u00f3digos", "ducta", "preocupan", "\u00e9tico", "fundamental.", "asociaciones", "profesionales,", "acm", "ieee,", "cooperado", "conjuntamente", "pr\u00e1ctica", "simplificada", "(figura", "1.3)", "pormenorizada", "(gotterbarn", "et", "al.,", "1999)", "agrega", "detalle", "sustancia", "corta.", "detr\u00e1s", "primeros", "p\u00e1rrafos", "pormenorizada:", "comercio,", "indus-", "tria,", "gobierno,", "medicina,", "contribuyen,", "partici-", "paci\u00f3n", "directa", "an\u00e1lisis,", "dise\u00f1o,", "rrollo,", "certificaci\u00f3n,", "acm/ieee", "(\u00a9", "ieee/acm,", "acm/ieee-cs", "fuerza", "conjunta", "pr\u00e1cticas", "pre\u00e1mbulo", "corta", "resume", "aspiraciones", "abstracci\u00f3n;", "cl\u00e1usulas", "dan", "detalles", "actuamos", "aspiraciones,", "legalistas", "tediosos;", "detalles,", "suelen", "resonantes", "vac\u00edas;", "conjunto,", "forman", "cohesivo.", "comprometerse", "ben\u00e9fica", "respetada.", "compromiso", "salud,", "bienestar", "p\u00fablico,", "adherirse", "ocho", "principios", "p\u00fablico:", "actuar", "consecuentemente", "p\u00fablico.", "empleador:", "fomente", "empleador,", "coherencia", "producto:", "relacionadas", "satisfagan", "altos", "posibles.", "juicio:", "integridad", "independencia", "juicio", "gesti\u00f3n:", "administradores", "l\u00edderes", "suscribir", "promover", "profesi\u00f3n:", "fomentar", "reputaci\u00f3n", "consecuente", "colegas:", "justos", "colegas", "apoyarlos.", "mismo:", "intervenir", "aprendizaje", "cuanto", "profesi\u00f3n,", "\u00e9tico.", "15m01_sommerville_ingenieria_1ed_se_001-026.indd", "oportunidades", "significativas", "correcto", "da\u00f1o,", "permitir", "hagan", "causen", "influir", "da\u00f1o.", "garantizar,", "esfuerzos", "usados", "correctamente,", "concordancia", "compromiso,", "contiene", "relacionados", "deci-", "siones", "tomadas", "practicantes,", "educadores,", "administradores,", "supervisores", "pol\u00edticos,", "aprendices", "profesi\u00f3n.", "identifican", "relaciones", "\u00e9ticamente", "responsables", "participan", "individuos,", "organizaciones,", "obligaciones", "relaciones.", "principio", "ilustraciones", "incluidas", "fundamentan", "humano", "cuidado", "afectadas", "elementos", "\u00fanicos", "formula", "quienquiera", "afirme", "aspire", "tengan", "visiones", "obje-", "tivos,", "enfrente", "dilemas", "desacuerdo,", "ejecutivos", "\u00bfc\u00f3mo", "reaccionar\u00eda?", "claramente,", "individuo", "naturaleza", "dis-", "crepancia.", "\u00bfes", "argumentar", "posici\u00f3n", "nizaci\u00f3n", "renunciar", "principio?", "siente", "\u00bfcu\u00e1ndo", "reporta", "administraci\u00f3n?", "discute", "apenas", "indicio,", "exagerando", "reacci\u00f3n", "situaci\u00f3n;", "deja", "tarde,", "dificultades.", "enfrentamos", "fortuna,", "menores", "resolverse", "demasiada", "dificultad.", "solucionarse,", "afronta,", "vez,", "acci\u00f3n", "empleo,", "decisi\u00f3n", "bien", "afectar", "otros,", "pareja", "hijos.", "surge", "dor", "act\u00faa", "presi\u00f3n", "falsifica", "seguridad.", "alertar", "manifestar,", "alguna", "forma,", "entregado", "inseguro?", "problema", "absolutos", "validado", "criterios", "predefinidos,", "demasiado", "estrictos.", "realidad", "operar\u00e1", "valide", "adecuada,", "falle", "cause", "accidente.", "detecci\u00f3n", "oportuna", "resultar", "lesiva", "empleador", "trabajadores;", "fracaso", "revelar", "da\u00f1ino", "otros.", "16m01_sommerville_ingenieria_1ed_se_001-026.indd", "formar", "criterio", "asuntos.", "ade-", "cuada", "percepciones", "implicados.", "potencial", "decisi\u00f3n.", "escenario", "peligroso,", "estar\u00eda", "justificado", "anunciarlo", "prensa", "(por", "ejemplo).", "tratar", "resol-", "dejar", "empleador.", "conflicto", "militares", "nuclea-", "res.", "respecto,", "sienten", "evitan", "par-", "ticipar", "alg\u00fan", "asociado", "militares.", "trabajar\u00e1n", "militares,", "armamento.", "sentir\u00e1n", "objeciones", "\u00e9ticas", "dejen", "antelaci\u00f3n", "vista.", "participa", "militar", "nuclear,", "contar", "voluntad", "asignado.", "empleado", "quiere", "siste-", "mas,", "tendr\u00e1n", "presionarlo", "haga", "tarde.", "\u00e1rea", "vuelven", "importan-", "prevalecen", "cuestiones", "cotidiana.", "considerarse", "vista", "filos\u00f3fico,", "tomen", "b\u00e1sicos", "analice", "b\u00e1sicos.", "laudon", "(1995)", "menor", "huff", "martin", "(1995).", "johnson", "computacional", "(2001)", "filos\u00f3fica.", "filos\u00f3fico", "abstracto", "relacionar", "preferible", "concreto", "plasmado", "pr\u00e1ctica.", "derecho", "propio.", "presen-", "tan,", "discusiones", "abstractas,", "discusi\u00f3n", "grupal", "ilustrar", "utilizan", "raz\u00f3n", "obedece", "mensajes", "producir.", "elegir\u00e1", "estudien", "mode-", "lado", "positivo", "hardware", "dispositivo.", "tama\u00f1o", "f\u00edsico,", "reacci\u00f3n,", "17m01_sommerville_ingenieria_1ed_se_001-026.indd", "energ\u00eda,", "utilizado", "dispositivo", "m\u00e9dico.", "cuyo", "principal", "usabilidad,", "privacidad", "datos.", "m\u00e9dicos", "recolectar", "forma.", "fiabili-", "dad,", "condiciones", "ambientes", "hostiles,", "mantenimiento.", "estaci\u00f3n", "meteorol\u00f3gica", "1.3.1", "m\u00e9dico", "simula", "p\u00e1ncreas", "(un", "\u00f3rgano", "interno).", "embebido,", "recopila", "informa-", "sensor", "dosis", "regulada", "insulina.", "sufren", "diabetes", "condici\u00f3n", "incapaz", "suficientes", "cantida-", "hormona", "llamada", "metaboliza", "glucosa", "(az\u00facar)", "sangre.", "convencional", "inyecciones", "regulares", "insu-", "lina", "gen\u00e9ticamente", "manipulada.", "diab\u00e9ticos", "calculan", "az\u00facar", "sangre", "medidor", "externo", "ajustan", "inyectarse.", "requerido", "sangre,", "\u00faltima", "inyec-", "bajos", "sangu\u00ednea", "(si", "mucha", "insulina)", "poca", "insulina).", "baja", "corto", "plazo,", "seria", "temporal", "cerebro", "inconsciencia", "muerte.", "lado,", "continuos", "elevados", "ocasio-", "nan", "ocular,", "renal", "cardiacos.", "recientes", "miniaturizados", "automatizados", "suministro", "monitorizan", "requiere,", "administran", "adecuada", "hospitalarios.", "permanentemente", "unidos", "cuerpos.", "controlado", "microsensor", "paciente,", "medir", "ciertos", "par\u00e1metros", "sangu\u00edneos", "proporcionales", "az\u00facar.", "env\u00eda", "controla-", "bomba,", "cual", "calcula", "18m01_sommerville_ingenieria_1ed_se_001-026.indd", "sita.", "se\u00f1ales", "miniaturizada", "administrar", "aguja", "unida.", "1.4", "ejemplos,", "saber", "mide", "conductividad", "el\u00e9ctrica", "bajo", "valo-", "res", "relacionarse", "pulso", "controlador.", "unidades", "pulsos", "bomba.", "1.5", "ilustra", "transforma", "entrada", "comandos", "impulsan", "opera", "correcta,", "grave", "caer\u00eda", "coma", "bajos.", "secuencia,", "sistema:", "requiera.", "correcta", "contrarrestar", "actual", "alarma", "reloj", "poder", "dep\u00f3sito", "bit\u00e1cora", "dosisc\u00e1lculo", "19m01_sommerville_ingenieria_1ed_se_001-026.indd", "implementarse", "siem-", "pre", "satisfaga", "requerimientos.", "posteriores", "detallados", "probar", "seguro.", "1.3.2", "mental", "m\u00e9dica,", "administra", "tratamientos", "reciben.", "hospitalario", "dedicado,", "asistir", "cl\u00ednicas", "especializadas", "re\u00fanen", "detallado", "problemas.", "asistencia", "pacientes,", "funcionan", "hospitales", "consultorios", "centros", "comunitarios.", "mhc-pms", "(sistema", "pacientes-atenci\u00f3n", "mental)", "cl\u00ednicas.", "centralizada", "operarse", "ella", "conectivi-", "dad", "red", "segura.", "red,", "emplean", "capaces", "descargar", "copias", "desconecta-", "dos.", "completo,", "m\u00e9dicas.", "interact\u00faa", "intercambia", "cl\u00ednica.", "1.6", "mhc-pms.", "metas", "globales:", "generar", "permita", "valorar", "gobierno.", "proporcionar", "paciente", "20m01_sommerville_ingenieria_1ed_se_001-026.indd", "4:44:32", "hallan", "desorganizados", "faltar", "citas,", "deliberada", "accidentalmente,", "perder", "recetas", "medicamentos,", "olvidar", "instrucciones", "irracionales", "llegar", "inesperada.", "pocos", "casos,", "mismos", "casa", "plazo.", "peligrosos,", "deban", "\u201cinternarse\u201d:", "confinarse", "hospital", "observaci\u00f3n.", "cl\u00ednico", "m\u00e9dicos,", "enfermeros", "visi-", "tadores", "(enfermeros", "visitan", "domicilio", "verificar", "tratamiento).", "recepcionistas", "archivo", "registros,", "administrativo", "redacta", "informes.", "registrar", "(nombre,", "direcci\u00f3n,", "edad,", "pa-", "riente", "cercano,", "etc\u00e9tera),", "consultas", "(fecha,", "m\u00e9dico,", "impresiones", "personales", "pacien-", "te,", "tratamientos.", "informes", "intervalos", "autoridad", "sanitaria.", "individual", "tes,", "an\u00f3nimos", "condiciones,", "tratamiento,", "primaria", "editan", "ven", "historial", "soporta", "res\u00famenes", "reunieron", "anterioridad", "enteren", "blemas", "prescribieron.", "monitorizaci\u00f3n", "monitoriza", "involucrados", "emite", "advertencias", "detectan", "posibles", "visto", "emitirse", "advertencia.", "pista", "internados", "verificaciones", "requeridas", "legalmente", "lleven", "correcto.", "administrativos", "genera", "mensualmente", "tivos", "muestran", "tratados", "cl\u00ednica,", "ingresaron", "salieron", "total", "inter-", "nados,", "medicamentos", "prescritos", "esta-", "blecen", "detenci\u00f3n", "obligatoria", "considerados", "peligro", "mis-", "mos", "aspecto,", "m\u00e9dica", "recomendar", "\u00e9stos,", "sujeto", "protecciones", "legislativas", "estrictas.", "act\u00fae", "ley", "decisiones,", "necesario,", "registren", "judicial.", "cr\u00ed-", "tico.", "b\u00e1sico", "confidencial", "nunca", "revele", "21m01_sommerville_ingenieria_1ed_se_001-026.indd", "m\u00e1s,", "autorizado", "patolog\u00edas", "vuelvan", "suicidas", "advertir", "potencialmente", "peligrosos.", "necesite,", "comprometida", "prescribir", "medicamento", "potencial:", "f\u00e1cil", "copia", "desconexi\u00f3n", "conservar", "varias", "analizan", "preferencias", "temporales", "1.3.3", "monitorizar", "mejorar", "exactitud", "predicciones", "meteorol\u00f3gicas", "remotas,", "gobierno", "pa\u00eds", "decidi\u00f3", "cientos", "estaciones", "\u00e1reas.", "instrumentos", "miden", "temperatura", "presi\u00f3n,", "luz", "solar,", "lluvia,", "rapidez", "viento.", "1.7),", "recolecta", "ciones", "disposici\u00f3n", "procesamiento.", "1.7", "meteo-", "rol\u00f3gicos,", "transmitirlo", "archivado", "abierto,", "archiva", "recuperar", "predicci\u00f3n", "meteorol\u00f3gica.", "comunica", "sat\u00e9lite", "\u00absistema\u00bb", "22m01_sommerville_ingenieria_1ed_se_001-026.indd", "us\u00f3", "s\u00edmbolo", "paquete", "indicar", "colecci\u00f3n", "componentes,", "identificaron", "este-", "reotipo", "\u00absistema\u00bb.", "indican", "ah\u00ed", "intercambio", "etapa,", "definirlos", "cli-", "matol\u00f3gicos", "viento,", "terreno", "aire,", "barom\u00e9trica", "lluvia", "periodo", "horas.", "peri\u00f3dicamente", "par\u00e1me-", "tros", "gestiona", "recolectados", "instrumentos.", "recolecci\u00f3n", "observacio-", "frecuentes;", "minuto.", "puesto", "ancho", "banda", "estrecho,", "concentraci\u00f3n", "transmite", "concentrados", "solicita", "si,", "raz\u00f3n,", "conexi\u00f3n,", "localmente", "reanude", "comunicaci\u00f3n.", "alimentada", "bater\u00edas", "autocontenida:", "fuentes", "energ\u00eda", "externas", "cables", "disponibles.", "v\u00ednculo", "satelital", "baja,", "mecanismo", "(solar", "e\u00f3lico)", "cargar", "bater\u00edas.", "abiertas,", "expuestas", "severas", "condicio-", "ambientales", "animales", "llegan", "da\u00f1arlas.", "encarga", "debe:", "instrumentos,", "comunicaci\u00f3n,", "reportar", "administraci\u00f3n.", "cargadas", "permitan;", "desconectar", "generadores", "adversas,", "viento", "fuerte.", "reconfiguraci\u00f3n", "sustituyan", "versiones,", "respaldo", "enciendan", "\u00e9ste.", "autocontenidas", "vigilancia,", "instalado", "simple.", "23m01_sommerville_ingenieria_1ed_se_001-026.indd", "programas,", "mantenimiento,", "aceptabilidad.", "universalmente", "aplicables", "pocas,", "alguna,", "sociedad.", "\u00fanicamente", "t\u00e9cnicos.", "establecen", "esperados", "miembros.", "sugeridas", "\u201cno", "silver", "bullet:", "essence", "and", "accidents", "of", "engineering\u201d.", "pesar", "publicaci\u00f3n,", "art\u00edculo", "buena", "cambiado.", "(f.", "p.", "brooks,", "ieee", "computer,", "(4),", "abril", "1987.)", "http://doi.ieeecomputersociety.org/10.1109/mc.1987.1663532.", "engineering", "code", "ethics", "is", "approved\u201d.", "fondo", "antecedentes", "larga", "c\u00f3digo.", "(comm.", "d.", "gotterbarn,", "k.", "miller,", "s.", "rogerson,", "1999.)", "http://portal.acm.org/citation.cfm?doid=317665.317682.", "professional", "issues", "engineering.", "examina", "legales", "prefiere", "textos", "te\u00f3ricos", "bott,", "a.", "coleman,", "j.", "eaton", "rowland,", "taylor", "francis.)", "24m01_sommerville_ingenieria_1ed_se_001-026.indd", "march/april", "2002.", "revista", "dedicado", "cambiado", "r\u00e1pidamente,", "art\u00edculos", "poco", "arcaicos,", "relevantes.", "(ieee", "(2),", "2002.)", "http:/", "/www2.", "computer.", "org/", "portal/", "web/", "\u201ca", "view", "20th", "21st", "century", "vistazo", "adelante", "distinguidos", "barry", "boehm", "identifica", "atemporales", "sugiere", "obsoletas.", "(b.", "boehm,", "proc.", "28th", "conf.,", "shanghai.", "2006.)", "http://doi.ieeecomputersociety.org/10.1145/1134285.1134288.", "ethics\u201d.", "42", "(6),", "junio", "2009.)", "1.1.", "explique", "1.2.", "personalizado?", "gen\u00e9rico?", "1.3.", "profesional?", "sugiera", "significativos.", "1.4.", "heterogeneidad,", "social,", "identifique", "xxi.", "(sugerencia:", "piense", "ambiente).", "1.5.", "estudiados", "1.1.2,", "explique,", "1.6.", "1.7.", "cambi\u00f3", "1.8.", "hecho", "certificados", "abogados.", "1.9.", "1.3,", "ilustre", "cl\u00e1usula.", "1.10.", "terrorismo,", "pa\u00edses", "planean", "desarrollaron", "siguen", "ciudadanos", "acciones.", "claramente", "privacidad.", "discuta", "25m01_sommerville_ingenieria_1ed_se_001-026.indd", "referencias", "d.,", "(1999).", "approved.", "comm.", "(10),", "102\u20137.", "holdener,", "t.", "(2008).", "ajax:", "definitive", "guide.", "sebastopol,", "ca.:", "o\u2019reilly", "associates.", "huff,", "c.", "martin,", "computing", "consequences:", "framework", "for", "teaching", "ethical", "computing.", "38", "(12),", "75\u201384.", "johnson,", "g.", "(2001).", "ethics.", "englewood", "cliffs,", "nj:", "prentice", "hall.", "laudon,", "concepts", "information", "technology.", "33\u20139.", "naur,", "b.", "(1969).", "reporte", "patrocinada", "comit\u00e9", "cient\u00edfico", "otan,", "garmisch,", "alemania,", "1968.", "26m01_sommerville_ingenieria_1ed_se_001-026.indd", "introducirlo", "idea", "introducir\u00e1", "sabr\u00e1", "cu\u00e1ndo", "usarlos;", "(rational", "unified", "process,", 